# config.py
# ここに設定を記載します

# LINEチャネルアクセストークン（LINE Developersで発行されたトークン）
LINE_CHANNEL_ACCESS_TOKEN = "basicコースでは使いません"

#AI_MODEL = "schroneko/llama-3.1-swallow-8b-instruct-v0.1:latest"
AI_MODEL = "gpt-4o"

#AI_URL = "http://host.docker.internal:11434"

DB_HOST = "db"

DB_USER = "me"

DB_PASSWORD = "me"

DB_NAME = "mydb"

DB_PORT = 3306

# VOICEVOXエンジンのURL
VOICEVOX_URL = "http://voicevox:50021"

# RabbitMQ settings
MQ_HOST = "rabbitmq"
MQ_RAW_QUEUE = "raw_actions"
MQ_PROCESSED_QUEUE = "processed_actions"

# Fixed root categories used for labeling
ROOT_CATEGORIES = [
    "政治","行政","政策",
    "法律","司法","倫理",
    "経済","金融","産業",
    "国","外交","安全保障",
    "労働",
    "社会","人権","福祉","ジェンダー",
    "防災","危機管理",
    "思想","宗教","哲学",
    "自然","環境","生態学","気候変動",
    "宇宙","天文学",
    "数学","物理学","化学","生物学",
    "医療","健康","生命科学",
    "農業","飲食","エネルギー",
    "情報技術",
    "工学","建築","デザイン","製造",
    "情報学","統計","解析",
    "文学","言語","語学",
    "歴史","考古学","文化人類学",
    "芸術",
    "ファッション","デザイン","建築",
    "食文化",
    "娯楽","サブカルチャー",
    "マスメディア","ジャーナリズム","パブリック・リレーションズ",
    "スポーツ","舞台芸術","ダンス","武道",
    "生活","家事","育児","介護",
    "住宅","DIY","インテリア",
    "健康","美容","フィットネス",
    "教育","学習","資格","能力開発",
    "趣味","レジャー","旅行","野外活動",
    "恋愛","結婚","家族","人間関係",
    "資産運用","ビジネススキル",
    "プロジェクトマネジメント","問題解決","ビジネススキル",
    "心理学","カウンセリング","メンタルヘルス",
    "哲学","倫理","死生観",
    "分析心理学","幸せ","クオリティ・オブ・ライフ",
    "瞑想","マインドフルネス","動機づけ",
    "コミュニケーション","人間関係"
]

